{
  "glossary": [
        {
            "en": "Artificial Intelligence (AI)",
            "th": "ประมวลผล (เอไอ)",
            "description": "ศาสตร์มุ่งเน้นเครื่องระบบให้สามารถทำงาน ห์ และได้ผลโดยไม่ต้องเขียนโปรแกรม"
        },
        {
            "en": "Machine Learning (ML)",
            "th": "การเรียนรู้ของเครื่อง (เอ็มแอล)",
            "description": "แขนงหนึ่งของ AI ที่ทำให้เครื่องสามารถเรียนรู้จากข้อมูลและปรับตัวเองได้โดยไม่ต้องเขียนโปรแกรมโดยตรง"
        },
        {
            "en": "Deep Learning (DL)",
            "th": "การเรียนรู้ลึก (แอล)",
            "description": "แขนงหนึ่งของ Machine Learning ที่ใช้โครงข่ายประสาทหลายชั้น เรียนรู้ข้อมูลซับซ้อน เช่น การจำรูปภาพ"
        },
        {
            "en": "Natural Language Processing (NLP)",
            "th": "การประมวลผลภาษา (เอ็นแอล)",
            "description": "ทำให้เครื่องสามารถเข้าใจ ห์ และตอบสนองต่อภาษาของมนุษย์ได้อย่าง"
        },
        {
            "en": "Algorithm",
            "th": "อัลกอริทึม",
            "description": "    "
        },
        {
            "en": "Data",
            "th": "ข้อมูล",
            "description": "ข้อเท็จจริง ตัวเลข ข้อความ ที่เก็บรวบรวมไว้เพื่อใช้ในการวิเคราะห์ ประมวลผล"
        },
        {
            "en": "Cloud Computing",
            "th": "การประมวลผลแบบคลาวด์",
            "description": "การให้บริการเครื่อง ฐานข้อมูล ผ่านอินเทอร์เน็ต"
        },
        {
            "en": "API (Application Programming Interface)",
            "th": "เอไอ (ส่วนต่อประสานโปรแกรมประยุกต์)",
            "description": "ของคำสั่ง กฎ และเครื่องมือช่วยให้แอปพลิเคชันต่าง ๆ สามารถสื่อสารและแลกเปลี่ยนข้อมูลได้"
        },
        {
            "en": "Blockchain",
            "th": "บล็อกเชน",
            "description": "เก็บข้อมูลแบบกระจายย์ ทำให้ข้อมูลไม่สามารถแก้ไขย้อนหลังได้ และตรวจสอบได้"
        },
        {
            "en": "Internet of Things (IoT)",
            "th": "อินเทอร์เน็ตของสรรพสิ่ง (ไอโอที)",
            "description": "เครื่องมือต่าง ๆ ที่เชื่อมต่อกันผ่านอินเทอร์เน็ต สามารถแลกเปลี่ยนข้อมูลและทำงานร่วมกัน"
        },
        {
            "en": "Cybersecurity",
            "th": "ความปลอดภัยทางไซเบอร์",
            "description": "การปกป้องระบบเครือข่าย ข้อมูล และทรัพยากรจากโจมตี การเข้าถึงโดยไม่ได้รับอนุญาต และการโจมตีทางไซเบอร์"
        },
        {
            "en": "Virtual Reality (VR)",
            "th": "ความเสมือน (อาร์)",
            "description": "จำลองสภาพแวดล้อมเสมือนมาให้สามารถโต้ตอบได้ผ่านอุปกรณ์เฉพาะ"
        },
        {
            "en": "Augmented Reality (AR)",
            "th": "ความเสริม (เออาร์)",
            "description": "นำข้อมูลเช่นภาพมาแสดงซ้อนบนโลก เอาเพื่อเพิ่มประสบการณ์ใช้งาน"
        },
        {
            "en": "Big Data",
            "th": "ข้อมูลขนาดใหญ่",
            "description": "ข้อมูลจำนวนมหาศาล ซับซ้อน และเปลี่ยนแปลงตลอดเวลา ซึ่งยากต่อการประมวลผลด้วยเครื่องคอมพิวเตอร์"
        },
        {
            "en": "Database",
            "th": "ฐานข้อมูล",
            "description": "ระบบที่ใช้เก็บและจัดข้อมูลอย่างเป็นระบบ เอาให้ง่ายต่อการค้นหาและประมวลผลข้อมูล"
        },
        {
            "en": "Edge Computing",
            "th": "เอดจ์คอมพิวเตอร์",
            "description": "การประมวลผลข้อมูลที่ใกล้แหล่งกำเนิดข้อมูล เอาเพื่อลดเวลาแฝงและเพิ่มความเร็วในการตอบสนอง"
        },
        {
            "en": "Quantum Computing",
            "th": "คอมพิวเตอร์ควอนตัม",
            "description": "การคำนวณที่ใช้ควอนตัมในการประมวลผลข้อมูล เร็วกว่าเครื่องคอมพิวเตอร์"
        },
        {
            "en": "5G",
            "th": "อินเทอร์เน็ต 5G",
            "description": "การสื่อสารไร้สายที่เร็ว ความหน่วงต่ำ สามารถเชื่อมต่ออุปกรณ์จำนวนมาก"
        }
    ]
}